## **`Data Exploration`**

In [5]:
# Lets discovering the data by head function.
tripdata.head()

,ride_id,rideable_type,started_at,ended_at,start_station_name,start_station_id,end_station_name,end_station_id,start_lat,start_lng,end_lat,end_lng,member_casual
0,F96D5A74A3E41399,electric_bike,2023-01-21 20:05:42,2023-01-21 20:16:33,Lincoln Ave & Fullerton Ave,TA1309000058,Hampden Ct & Diversey Ave,202480.0,41.924074,-87.646278,41.930000,-87.640000,member
1,13CB7EB698CEDB88,classic_bike,2023-01-10 15:37:36,2023-01-10 15:46:05,Kimbark Ave & 53rd St,TA1309000037,Greenwood Ave & 47th St,TA1308000002,41.799568,-87.594747,41.809835,-87.599383,member
2,BD88A2E670661CE5,electric_bike,2023-01-02 07:51:57,2023-01-02 08:05:11,Western Ave & Lunt Ave,RP-005,Valli Produce - Evanston Plaza,599,42.008571,-87.690483,42.039742,-87.699413,casual
3,C90792D034FED968,classic_bike,2023-01-22 10:52:58,2023-01-22 11:01:44,Kimbark Ave & 53rd St,TA1309000037,Greenwood Ave & 47th St,TA1308000002,41.799568,-87.594747,41.809835,-87.599383,member
4,3397017529188E8A,classic_bike,2023-01-12 13:58:01,2023-01-12 14:13:20,Kimbark Ave & 53rd St,TA1309000037,Greenwood Ave & 47th St,TA1308000002,41.799568,-87.594747,41.809835,-87.599383,member

In [6]:
tripdata.size

74358401

In [7]:
# Shape of the data.
tripdata.shape

(5719877, 13)

In [8]:
#Statistically describe the data by describe funciton.
tripdata.describe()

          start_lat     start_lng       end_lat       end_lng
count  5.719877e+06  5.719877e+06  5.712887e+06  5.712887e+06
mean   4.190288e+01 -8.764704e+01  4.190322e+01 -8.764720e+01
std    4.505556e-02  2.733412e-02  5.444371e-02  6.919621e-02
min    4.163000e+01 -8.794000e+01  0.000000e+00 -8.816000e+01
25%    4.188096e+01 -8.766000e+01  4.188103e+01 -8.766027e+01
50%    4.189902e+01 -8.764403e+01  4.190000e+01 -8.764410e+01
75%    4.193000e+01 -8.762991e+01  4.193000e+01 -8.763000e+01
max    4.207000e+01 -8.746000e+01  4.218000e+01  0.000000e+00

In [9]:
#Checking the more infomation about data columns by using info() function
tripdata.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5719877 entries, 0 to 224072
Data columns (total 13 columns):
 #   Column              Dtype
---  ------              -----
 0   ride_id             object
 1   rideable_type       object
 2   started_at          object
 3   ended_at            object
 4   start_station_name  object
 5   start_station_id    object
 6   end_station_name    object
 7   end_station_id      object
 8   start_lat           float64
 9   start_lng           float64
 10  end_lat             float64
 11  end_lng             float64
 12  member_casual       object
dtypes: float64(4), object(9)
memory usage: 610.9+ MB

If the format of the data changes after running this code, I will assume that there were duplicate rows.

In [10]:
#Drop the duplicates. 
tripdata.drop_duplicates().shape

(5719877, 13)